/*
 * --------------------------------------------------------------------------- *
 * File: Information.tsx                                                       *
 * Project: website                                                            *
 * Created Date: 24 Jul 2023                                                   *
 * Author: Vikas K Solegaonkar (vikas@solegaonkar.com)                         *
 * Copyright(c) Vikas K Solegaonkar, 2023                                      *
 *                                                                             *
 * Last Modified: Wed Jul 26 2023                                              *
 * Modified By: Vikas K Solegaonkar                                            *
 *                                                                             *
 * HISTORY:                                                                    *
 * --------------------------------------------------------------------------- *
 * Date         By     Comments                                                *
 * --------------------------------------------------------------------------- *
 */

/* eslint-disable no-irregular-whitespace */

import { Card, CardBody, Divider, GridItem, Heading, SimpleGrid, Text } from "@chakra-ui/react";
import Dashboard from "./Dashboard";

function Information() {
  return (
    <SimpleGrid spacing={10} columns={2} textAlign={"left"}>
      <GridItem colSpan={{ base: 2, md: 1 }}>
        <Card borderTop="4px" borderColor="orange.100" bg="white">
          <CardBody color="gray.700">
            <Text>
              प्रखर बुद्धिवादी साक्षात्कारी संत श्रीगुलाबराव महाराज हे विसाव्या शतकातील एक प्रज्ञाचक्षु विभूती होते.
              जन्माध असूनही केवळ चौतीस वर्षाच्या आ विर्भाव काळात त्यांनी 134 लहान- मोठ्या,गद्य-पद्य, ग्रंथांची रचना
              केली. हे ग्रंथ हिन्दी-मराठी-संस्कृत भाषेत असून ते श्रुतलेखनाद्वारे संपन्न झालेत. यात
              सूत्रग्रंथ,भाष्यग्रंथ, भक्तिग्रंथ, योगग्रंथ, शास्त्रग्रंथ, संगीतपर, आयुर्वेदपर, प्रकरणग्रंथ, गाथा व
              पदावली, लोकगीत, आख्यान, निबंध, संवादपर व पत्रे इत्यादीचा समावेश आहे. विशेष म्हणजे या रचनावलीत बालक,
              मुमुक्षू, साधक ते सिध्दापर्यंतच्या व्यक्तिंना परमार्थ व भौतिक व्यवहाराबाबत मूलभूत मौलिक मार्गदर्शन आहे.
            </Text>
          </CardBody>
        </Card>
      </GridItem>
      <GridItem colSpan={{ base: 2, md: 1 }}>
        <Card borderTop="4px" borderColor="orange.100" bg="white">
          <CardBody color="gray.700">
            <Text>
              महाराजांचे समग्र ग्रंथ शांकरमतानुसरण करणा-या ज्ञानेश्वर माऊलीकृत वारकरी संप्रदायाच्या अद्वैत भक्तीचेच
              तर्कशुद्ध प्रतिपादन आहे.
            </Text>
            <Divider py={2} borderColor="gray.100" />
            <Text>
              हिन्दुस्तानातील तात्कालिन दिग्गज आचार्यांनी श्रीगुलाबराव महाराजांना प्रतिनारदाचार्य, आणि प्रति
              कृष्णद्वैपायन व्यास संबोधले होते. महाराज स्वतःला 'ज्ञानेश्वरकन्या व कृष्णपत्नी' मानत. ही मधुरा भक्तीतील
              भावना मात्र आहे. कर्म, ज्ञान व योग या मार्गांची यत्किंचितही उपेक्षा न करता त्यांनी भक्तिमार्गाला तर्कनिष्ठ
              शास्त्रीय स्वरूप दिले. उपरोक्त तीन मार्गाहून कलियुगात भक्तिमार्गच कसा समग्र जाती व समाजाला जास्त उपादेय व
              सुलभ आहे, हे श्रुती-स्मृतींच्या आधारे पटवून दिले आहे.
            </Text>
          </CardBody>
        </Card>
      </GridItem>
      <GridItem colSpan={2}>
        <Card borderTop="4px" borderColor="red.200" bg="orange.100">
          <CardBody color="gray.700">
            <Heading color="red.700" fontWeight="normal">
              जीवनचरित्र​
            </Heading>
          </CardBody>
        </Card>
      </GridItem>
      <GridItem colSpan={{ base: 2, md: 1 }}>
        <Card borderTop="4px" borderColor="orange.100" bg="white">
          <CardBody color="gray.700">
            <Divider py={2} borderColor="gray.100" />
            <Text>
              अमरावती जिल्ह्यातील माधान या गावचे पाटील गुंडोजी मोहोड व त्यांची पत्नी अलोकाबाई यांचे गुलाबराव हे चिरंजीव
              (जन्म6जुलै 1881 आषाढ शुध्द दशमी, लोणी टाकळी ता. माधान ).नवव्या महिन्यातच ते नेत्रहीन झाले. 1896मधे
              मनकर्णिका यांच्याशी विवाह झाला. 1900 सालापासूनच महाराजांच्या दैवी गुणांचा उदय व सर्वज्ञतेचा परिचय होऊ
              लागला.1901ला श्रीज्ञानेश्वर महाराजांचा साक्षात अनुग्रह. 1903 पासून कात्यायनी व्रताचा आरंभ.1905 पासून विविध
              ग्रंथांची रचना. 1907 पासून अभंग रचनेस व निबंधात्मक लिखाणास प्रारंभ. मुमुक्षू नियतकालिकात अनेक धार्मिक
              विषयावर परखड लिखाण.
            </Text>
            <Divider py={2} borderColor="gray.100" />
            <Text>
              20 सप्टेंबर 1915, भाद्रपद शुक्ल 12 पुणे येथील चाकण ऑइल मिलच्या परिसरातील एका घरातून महाप्रयाण केले.आपली
              कोणतीही समाधी करू नये असे बजावून ठेवले होते.
            </Text>
            <Divider py={2} borderColor="gray.100" />
            <Text>
              1890 च्या काळात माधानसारख्या खेड्यात शालेय शिक्षणाची व्यवस्थाच नव्हती.त्यांत अंधांला कुठून शिक्षण मिळणार?
              अश्या परिस्थितीत त्यांनी सुशिक्षित लोकांना दक्षिणा देऊन आध्यामिक ग्रंथ श्रवण केले. पुढे तर अनेक ग्रंथ
              मागवून श्रवण करीत त्यावर उहापोह करीत अद्भुत भाष्य करू लागले. डार्विन, स्पेन्सर, बेझंट यांच्या
              तत्त्वज्ञानावर, इलेक्ट्रॉनिक थियरीजची आधुनिक मीमांसा केली श्रीगुलाबराव महाराजांचे पट्टशिष्य व उत्तराधिकारी
              वेदान्तकेसरी बाबाजी महाराज पंडित म्हणतात -
            </Text>
            <Divider py={2} borderColor="gray.100" />
            <Text>
              "श्रीशंकराचार्यांच्या पुष्कळशा ग्रंथातून व त्यांच्या संन्यासमार्गी अनुयायांच्या ग्रंथातून निर्गुणाचे वर्णन
              आले असल्यामुळेभक्तिमार्गाचे आलंबन जे सगुण रामकृष्णादि परब्रह्म त्यांच्या स्वरूपाविषयी बरेच अपसमज
              वेदान्ताभ्यासू लोकात व वारकरी वर्गात उत्पन्न झाले."
            </Text>
            <Divider py={2} borderColor="gray.100" />
            <Text>
              "भक्तीमार्ग हा अज्ञानाचा मार्ग. निर्गुणाच्या प्राप्तीकरिता लागणारी एकाग्रता भक्तिमार्गाने प्राप्तकरून
              घेण्याकरिता भक्तिमार्ग संतांनी प्रगट केला. वास्तविक पाहता सगुणापेक्षा निर्गुण श्रेष्ठ असून त्याच्या
              प्राप्तीकरिता सगुणाची भक्ती सांगितली आहे. ज्ञानानंतर सगुणाची भक्ती राहत नाही. कारण ज्ञानाने सर्व सगुण
              मिथ्या ठरल्यावर सगुणभक्ती होऊ शकत नाही.व त्यावर प्रेम बसू शकत नाही."
            </Text>
          </CardBody>
        </Card>
      </GridItem>
      <GridItem colSpan={{ base: 2, md: 1 }}>
        <Card borderTop="4px" borderColor="orange.100" bg="white">
          <CardBody color="gray.700">
            <Text>
              आद्यशंकराचार्यांनी मान्य केलेल्या प्रस्थानत्रयीच्या सिध्दांतावरूनच हे वरील अपसमज कसे वेदांतविरुध्द आहेत हे
              दाखवून, सगुण स्वरूपही कसे निरुपाधिक आहे व त्याचे ठिकाणी ज्ञानानंतरहि भक्ती करणेअंतीम साध्याच्या दृष्टिने
              कसे आवश्यक आहे हे अने ग्रंथ लिहून सप्रमाण सिध्द केले आहे.हेच श्रीमहाराजांचे मुख्य अवतारकार्य होय.
            </Text>
            <Divider p={2} borderColor="gray.100" />
            <Text>
              श्रीगुलाबराव महाराजांनी 'संप्रदाय कुसुममधु' या लहा ग्रंथात आपण कोणकोणत्या संप्रदायाच्या भावना आपल्या
              मधुराद्वैत संप्रदायात समाविष्ट केल्या आहेत ते स्पष्ट तर केलेच पण त्यांच्या आचार्य मंडळीसह आपल्या समकालीन
              संतजनांना अत्यंत विनम्रपणे वंदन केले आहे.
            </Text>
            <Divider py={2} borderColor="gray.100" />
            <Text>
              यात वल्लभाचार्य, रामानुजाचार्य,मध्वाचार्य,निंबार्क अश्या ज्येष्ठ संप्रदायांचा समावेश आहे. यामुळेच त्यांना
              भारतीय दर्शन जगतात 'समन्वयमहर्षी' असेही म्हंटले जाते.
            </Text>
            <Divider p={2} borderColor="gray.100" />
            <Text>
              शांकर अद्वैत व भक्तिचा पूर्ण समन्वय, भक्तिच्या 16 प्रकाराची मांडणी, लालन, वात्सल्य, दास्य, सख्य इ. भक्ती
              माधुर्यभक्तीत अंतर्भूत आहेत हे सिध्द केले. व तिच्यावरील दोषारोपांचे तर्कशुद्ध खंडण. योगी, ज्ञानी व भक्त
              तसेच ज्ञान, उपासना व भक्तीतील भेदविवेचन. बुवाबाजी व चमत्कारांचे खंडण, नाममहात्म्य अर्थवाद आहे या आरोपाला
              खोडून काढले. योग प्रभाव या ग्रंथात योगाच्या नवीन प्रक्रिया दिल्या.
            </Text>
            <Divider py={2} borderColor="gray.100" />
            <Text>
              आधुनिक योग्यांच्या चुकीच्या संकल्पनांचे खंडन केले. आंतर व बाह्य समाधीचे नवे मूलगामी विवेचन केले.
            </Text>
            <Divider p={2} borderColor="gray.100" />
            <Text>
              नव्या छंदांची निर्मिती केली. आयुर्वेदावर मानसायुर्वेद' संगीतावर 'गानसोपान' व काव्यशास्त्रावर
              'काव्यसूत्रसंहिता' हे मौलिक ग्रंथ लिहिले. आजच्या काळात 'महाराज' या संज्ञेचा अर्थच बदलून गेला आहे.
              तर्कनिष्ठ बुध्दिवादी गुलाबराव महाराज यांची गणना 'आचार्य' परंपरेतच करायला हवी. म्हणूनच गुरुदेव रानडे,
              कृष्णानंद सरस्वती सारख्या विद्वान मंडळींनी त्यांचा गौरव प्रतिनारदाचार्य या शब्दात केला.त्यांचे नाथ
              संप्रदायी नाम 'पांडुरंगनाथ' असून दर्शन जगतात ते 'मधुराद्वैताचार्य' संबोधले जातात.
            </Text>
          </CardBody>
        </Card>
      </GridItem>
      <GridItem colSpan={2}>
        <Card borderTop="4px" borderColor="red.200" bg="orange.100">
          <CardBody color="gray.700">
            <Heading color="red.700" fontWeight="normal">
              पुस्तके
            </Heading>
          </CardBody>
        </Card>
        <Card borderTop="4px" borderColor="orange.100" bg="white">
          <CardBody color="gray.700">
            <Text fontWeight="bold" color="red.800">
              "ब्रह्मज्ञान होण्यापूर्वी, ब्रह्मज्ञान होण्याकरिता व ब्रह्मज्ञानानंतर जिवंतपणीच जीवन्मुक्ती व
              विदेहमुक्तीचे सुख भोगण्याकरिता, ज्ञानोत्तर रामकृष्णादि सगुण साकाराची भक्ती अवश्य केली पाहिजे."
            </Text>
          </CardBody>
        </Card>
      </GridItem>
      <GridItem colSpan={{ base: 2, md: 1 }}>
        <Card borderTop="4px" borderColor="orange.100" bg="white">
          <CardBody color="gray.700">
            <Text>
              श्रीगुलाबराव महाराजांच्या ग्रंथाचे हे सार आहे. हिन्दुस्तानातील तात्कालिन दिग्गज आचार्यांनी श्रीगुलाबराव
              महाराजांना प्रतिनारदाचार्य, आणि प्रति कृष्णद्वैपायन व्यास संबोधले होते. महाराज स्वतःला 'ज्ञानेश्वरकन्या व
              कृष्णपत्नी' मानत. ही मधुरा भक्तीतील भावना मात्र आहे.
            </Text>
          </CardBody>
        </Card>
      </GridItem>
      <GridItem colSpan={{ base: 2, md: 1 }}>
        <Card borderTop="4px" borderColor="orange.100" bg="white">
          <CardBody color="gray.700">
            <Text>
              कर्म, ज्ञान व योग या मार्गांची यत्किंचितही उपेक्षा न करता त्यांनी भक्तिमार्गाला तर्कनिष्ठ शास्त्रीय स्वरूप
              दिले. उपरोक्त तीन मार्गाहून कलियुगात भक्तिमार्गच कसा समग्र जाती व समाजाला जास्त उपादेय व सुलभ आहे, हे
              श्रुती-स्मृतींच्या आधारे पटवून दिले आहे.
            </Text>
          </CardBody>
        </Card>
      </GridItem>
      <GridItem colSpan={2}>
        <Card>
          <CardBody color="gray.700">
            <Text>
              श्री राम पण्डित यान्नी ही सारी पुस्तके आज वर आपल्या घरी जपली आहेत​. त्यंच्या वतीने इथे सर्वन्न उपलब्ध केली
              आहेत​.
            </Text>
            <Dashboard />
          </CardBody>
        </Card>
      </GridItem>
    </SimpleGrid>
  );
}

export default Information;
